In [4]:
import pandas as pd
import numpy as np 
import seaborn as sns
import matplotlib.pyplot as plt 
%matplotlib inline

### Handle Categorical Features

##### One Hot Encoding

In [8]:
df=pd.read_csv(r'C:\Users\asifk\Downloads\train.csv',usecols=['Sex'])

In [10]:
df.head()

      Sex
0    male
1  female
2  female
3  female
4    male

In [13]:
pd.get_dummies(df,drop_first=True).head()

   Sex_male
0         1
1         0
2         0
3         0
4         1

In [14]:
df=pd.read_csv(r'C:\Users\asifk\Downloads\train.csv',usecols=['Embarked'])

In [15]:
df

    Embarked
0          S
1          C
2          S
3          S
4          S
..       ...
886        S
887        S
888        S
889        C
890        Q

[891 rows x 1 columns]

In [17]:
pd.get_dummies(df,drop_first=True).head()

   Embarked_Q  Embarked_S
0           0           1
1           0           0
2           0           1
3           0           1
4           0           1


#### Onehotencoding with many categories in a feature

In [18]:
df=pd.read_csv(r'C:\Users\asifk\Downloads\mercedes.csv',usecols=["X0","X1","X2","X3","X4","X5","X6"])

In [20]:
df.head()

   X0 X1  X2 X3 X4 X5 X6
0   k  v  at  a  d  u  j
1   k  t  av  e  d  y  l
2  az  w   n  c  d  x  j
3  az  t   n  f  d  x  l
4  az  v   n  f  d  h  d

In [24]:
for i in df.columns:
    print(len(df[i].unique()))

47
27
44
7
4
29
12

In [33]:
df['X1'].value_counts().sort_values(ascending=False).head(10)

aa    833
s     598
b     592
l     590
v     408
r     251
i     203
a     143
c     121
o      82
Name: X1, dtype: int64

In [34]:
list_top10=df['X1'].value_counts().sort_values(ascending=False).head(10).index

In [37]:
list_top10=list(list_top10)

In [38]:
list_top10

['aa', 's', 'b', 'l', 'v', 'r', 'i', 'a', 'c', 'o']

In [39]:
for categories in list_top10:
    df[categories]=np.where(df['X1']==categories,1,0)

In [43]:

list_top10.append('X1')

In [44]:
df[list_top10].head(10)

   aa  s  b  l  v  r  i  a  c  o X1
0   0  0  0  0  1  0  0  0  0  0  v
1   0  0  0  0  0  0  0  0  0  0  t
2   0  0  0  0  0  0  0  0  0  0  w
3   0  0  0  0  0  0  0  0  0  0  t
4   0  0  0  0  1  0  0  0  0  0  v
5   0  0  1  0  0  0  0  0  0  0  b
6   0  0  0  0  0  1  0  0  0  0  r
7   0  0  0  1  0  0  0  0  0  0  l
8   0  1  0  0  0  0  0  0  0  0  s
9   0  0  1  0  0  0  0  0  0  0  b

### Ordinal Number Encoding

In [45]:
import datetime

In [46]:
today=datetime.datetime.today()

In [47]:
today

datetime.datetime(2021, 1, 27, 17, 24, 55, 823082)

In [48]:
today-datetime.timedelta(3)

datetime.datetime(2021, 1, 24, 17, 24, 55, 823082)

In [50]:
#### List Comprehension
days=[today-datetime.timedelta(x) for x in range(0,30)]

In [51]:
df=pd.DataFrame(days)

In [53]:
df.columns=['days']

In [55]:
df.head(5)

                        days
0 2021-01-27 17:24:55.823082
1 2021-01-26 17:24:55.823082
2 2021-01-25 17:24:55.823082
3 2021-01-24 17:24:55.823082
4 2021-01-23 17:24:55.823082

In [61]:
df['Weekday'] = df['days'].dt.day_name()

In [66]:
df.Weekday.unique()

array(['Wednesday', 'Tuesday', 'Monday', 'Sunday', 'Saturday', 'Friday',
       'Thursday'], dtype=object)

In [67]:
dictionary={'Monday':1,'Tuesday':2,'Wednesday':3,'Thursday':4,'Friday':5,'Saturday':6,'Sunday':7}

In [68]:
dictionary

{'Monday': 1,
 'Tuesday': 2,
 'Wednesday': 3,
 'Thursday': 4,
 'Friday': 5,
 'Saturday': 6,
 'Sunday': 7}

In [69]:
df['Weekday_Ordinal']=df['Weekday'].map(dictionary)

In [72]:
df.head(10)

                        days    Weekday  Weekday_Ordinal
0 2021-01-27 17:24:55.823082  Wednesday                3
1 2021-01-26 17:24:55.823082    Tuesday                2
2 2021-01-25 17:24:55.823082     Monday                1
3 2021-01-24 17:24:55.823082     Sunday                7
4 2021-01-23 17:24:55.823082   Saturday                6
5 2021-01-22 17:24:55.823082     Friday                5
6 2021-01-21 17:24:55.823082   Thursday                4
7 2021-01-20 17:24:55.823082  Wednesday                3
8 2021-01-19 17:24:55.823082    Tuesday                2
9 2021-01-18 17:24:55.823082     Monday                1

### Count Or Frequency Encoding

In [73]:
df = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data' , header = None,index_col=None)
df.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [74]:
columns=[1,3,5,6,7,8,9,13]

In [75]:
df=df[columns]

In [78]:
df.columns=['Employment','Degree','Status','Designation','family_job','Race','Sex','Country']
df.head()

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [79]:
for feature in df.columns:
    print(feature,":",len(df[feature].unique()))

Employment : 9
Degree : 16
Status : 7
Designation : 15
family_job : 6
Race : 5
Sex : 2
Country : 42

In [85]:
country_map=df['Country'].value_counts().to_dict()

In [86]:
df['Country']=df['Country'].map(country_map)

In [88]:
df.head()

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95

#### Advantages
Easy To Use

Not increasing feature space
##### Disadvantages
It will provide same weight if the frequencies are same

### Target Guided Ordinal Encoding

Ordering the labels according to the target

Replace the labels by the joint probability of being 1 or 0

In [113]:
df=pd.read_csv(r'C:\Users\asifk\Downloads\train.csv',usecols=['Cabin','Survived'])

In [114]:
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [115]:
df['Cabin']=df['Cabin'].fillna('Missing')

In [116]:
df['Cabin']=df['Cabin'].astype(str).str[0]

In [117]:
df['Cabin'].unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [99]:
df.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [101]:
ordinal_labels=df.groupby(['Cabin'])['Survived'].mean().sort_values().index

In [102]:
ordinal_labels

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [103]:
enumerate(ordinal_labels,0)

In [105]:
ordinal_labels2={k:i for i,k in enumerate(ordinal_labels,0)}

In [106]:
ordinal_labels2

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [107]:
df['Cabin_ordinal_label']=df['Cabin'].map(ordinal_labels2)

In [109]:
df.head()

   Survived Cabin  Cabin_ordinal_label
0         0     M                    1
1         1     C                    4
2         1     M                    1
3         1     C                    4
4         0     M                    1

### Mean Encoding

In [118]:
mean_ordinal=df.groupby(['Cabin'])['Survived'].mean().to_dict()

In [119]:
mean_ordinal

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'M': 0.29985443959243085,
 'T': 0.0}

In [ ]:
df['mean_ordinal_encode']=df['Cabin'].map(mean_ordinal)
df.head()